InformationRegisters/сабЭлектронныеПисьма.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>сабЭлектронныеПисьма</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Отправлено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстПисьма</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаПроизводство</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/РегламентныеЗаданияРасширения/Ext/Module.bsl
Процедура ВыполнитьРегламентнуюЗадачуЗагрузкаВыписокИзКлиентБанка() Экспорт
	
	ИмяСобытия = НСтр("ru = 'Загрузка выписок из клиент-банка'", ОбщегоНазначения.КодОсновногоЯзыка());
	Обработка = Обработки.сабЗагрузкаВыписокИзКлиентБанка.Создать();
	Обработка.ВыполнитьКоманду("сабЗагрузкаВыписокИзКлиентБанка", Неопределено);
    Комментарий = НСтр("ru = 'Задание выполнено'", ОбщегоНазначения.КодОсновногоЯзыка());
	ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Примечание, , , Комментарий);
	
КонецПроцедуры

Процедура ВыполнитьРегламентнуюЗадачуРассылкаОповещенийОСозданииДокументовНаЭлектроннуюПочту() Экспорт
	
	ИмяСобытия = НСтр("ru = 'Рассылка оповещений о создании документов на электронную почту'", ОбщегоНазначения.КодОсновногоЯзыка());
	УчетнаяЗапись = Справочники.УчетныеЗаписиЭлектроннойПочты.СистемнаяУчетнаяЗаписьЭлектроннойПочты;
	
	
	НаборЗаписей = РегистрыСведений.сабЭлектронныеПисьма.СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();
	
	Для каждого Запись из НаборЗаписей Цикл
		
		Если Запись.Отправлено = Ложь Тогда
			
			ПараметрыОтправки = Новый Структура;
			ПараметрыОтправки.Вставить("Кому", Запись.Получатель);
			ПараметрыОтправки.Вставить("Тема", Запись.Тема);
			ПараметрыОтправки.Вставить("Тело", Запись.ТекстПисьма);
			Попытка
				УстановитьПривилегированныйРежим(Истина);
				РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(УчетнаяЗапись, ПараметрыОтправки);
				Запись.Отправлено = Истина;
				Запись.ДатаОтправки = ТекущаяДата();
				УстановитьПривилегированныйРежим(Ложь);
			Исключение
				ОписаниеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Примечание, , , ОписаниеОшибки);
			КонецПопытки;
			
		КонецЕсли; 
	КонецЦикла;
	
	НаборЗаписей.Записать();
	
	Комментарий = НСтр("ru = 'Задание выполнено'", ОбщегоНазначения.КодОсновногоЯзыка());
	ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Примечание, , , Комментарий);
	
КонецПроцедуры
